#массив для колоды
pack = [
    'A♠', '6♠', '7♠', '8♠', '9♠', '10♠', 'J♠', 'Q♠', 'K♠'
    'A♣', '6♣', '7♣', '8♣', '9♣', '10♣', 'J♣', 'Q♣', 'K♣'
    'A♥', '6♥', '7♥', '8♥', '9♥', '10♥', 'J♥', 'Q♥', 'K♥'
    'A♦', '6♦', '7♦', '8♦', '9♦', '10♦', 'J♦', 'Q♦', 'K♦'
    ]

#class Player:
"""для класса надо функция, которая будет перемешивать колоду и раздавать объектам по 6 карт. 
сравнение карт будет происходить непосредственно при игре: надо сделать так, чтобы туз был самым маленьким, а король -
самым старшим. пока на 36 делаем, потом можно добавить и джокеров, и меньшие карты (если будет желание). 
еще надо продумать козырь: при сравнении карт он будет наибольшим. 
тут мои полномочия пока всё :-)"""
